app/controllers/movies_controller.rb

  def add_tmdb
    puts "enters right controller"
    idArr=Array.new
    h=params[:selected_movies]
    #puts h.to_s
  if(h==nil)
    puts "IN IF"
    flash[:notice]="no movies were selected"
    redirect_to movies_path
  else
     h.each_key {|key|
        idArr << key
     }
     @movie_string=""
    idArr.each do |i|
      #puts i
      string=Movie.create_from_tmdb i
---
INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "The Lion King 1½"], ["rating", "rating: PG"], ["release_date", "2004-02-09 00:00:00.000000"], ["created_at", "2015-10-25 17:50:57.878882"], ["updated_at", "2015-10-25 17:50:57.878882"]]